namespace _05._BinarySearchTree
{
	internal class Program
	{
		/******************************************************************
		* 이진탐색트리 (BinarySearchTree)
		* 
		* 이진속성과 탐색속성을 적용한 트리
		* 이진탐색을 통한 탐색영역을 절반으로 줄여가며 탐색 가능
		* 이진 : 부모노드는 최대 2개의 자식노드를 가질 수 있음
		* 탐색 : 자신의 노드보다 작은 값들은 왼쪽, 큰 값들은 오른쪽에 위치
		* 
		* 정렬이 되어있을 때 사용하기 좋음
		* 순차탐색 : O(n) - 무조건 가능
		* 이진탐색 : O(log2n) = O(logn) -> 정렬된 데이터만 가능
		* ex) 업다운
		* 
		* 이진탐색트리 만드는 방법
		* 부모 기준으로 작은값은 왼쪽, 큰값은 오른쪽에 배치
		* 자식은 2개까지만 갖는 것을 원칙으로 한다.
		* -> 이진탐색트리는 정렬을 보장해준다. 나중에 또 얘기나옴
		*******************************************************************/

		// <이진탐색트리 구현>
		// 이진탐색트리는 모든 노드들이 최대 2개의 자식노드를 가질 수 있으며
		// 자신의 노드보다 작은 값들은 왼쪽, 큰 값들은 오른쪽에 위치시킴
		//
		//             23
		//      ┌──────┴──────┐
		//      11            38
		//   ┌──┴──┐       ┌──┴──┐
		//   3     19      31    65
		//   └─┐ ┌─┴─┐   ┌─┘     └─┐
		//     6 17  22  24        87


		// <이진탐색트리 탐색>
		// 아래의 이진탐색트리에서 17 탐색
		// 루트 노드부터 시작하여 탐색하는 값과 비교하여,
		// 작은 경우 왼쪽자식노드로, 큰 경우 오른쪽자식노드를 탐색
		//
		//             23(↙)
		//      ┌──────┴──────┐
		//      11(↘)         38
		//   ┌──┴──┐       ┌──┴──┐
		//   3     19(↙)   31    65
		//   └┐  ┌─┴─┐   ┌─┘
		//    6 (17)  22  24


		// <이진탐색트리 삽입>
		// 아래의 이진탐색트리에서 35 삽입
		// 루트 노드부터 시작하여 삽입하는 값과 비교하여,
		// 작은 경우 왼쪽자식노드로, 큰 경우 오른쪽자식노드로 하강
		// 만약 빈공간이라면 빈공간에 삽입
		//
		//             23(↘)                          23
		//      ┌──────┴──────┐                ┌──────┴──────┐
		//      11            38(↙)            11            38
		//   ┌──┴──┐       ┌──┴──┐      =>  ┌──┴──┐       ┌──┴──┐ 
		//   3     19      31(↘) 65         3     19      31    65
		//   └─┐ ┌─┴─┐   ┌─┘                └─┐ ┌─┴─┐   ┌─┴─┐
		//     6 17  22  24                   6 17  22  24 (35)


		// <이진탐색트리 삭제>
		// 1. 자식이 0개인 노드의 삭제 : 단순 삭제 진행
		// 아래의 이진탐색트리에서 22 삭제
		//
		//             23                             23
		//      ┌──────┴──────┐                ┌──────┴──────┐
		//      11            38               11            38
		//   ┌──┴──┐       ┌──┴──┐    =>    ┌──┴──┐       ┌──┴──┐
		//   3     19      31    65         3     19      31    65
		//   └─┐ ┌─┴─┐   ┌─┘                └─┐ ┌─┘     ┌─┴─┐
		//     6 17 (22) 24                   6 17      24  35
		//
		// 2. 자식이 1개인 노드의 삭제 : 삭제하는 노드의 부모와 자식을 연결 후 삭제
		// 아래의 이진탐색트리에서 38 삭제
		//
		//            23                              23
		//     ┌──────┴──────┐                 ┌──────┴──────┐
		//     11            (38)              11            31
		//  ┌──┴──┐       ┌──┘        =>    ┌──┴──┐       ┌──┴──┐ 
		//  3     19      31                3     19      24    35
		//  └─┐ ┌─┴─┐   ┌─┴─┐               └─┐ ┌─┴─┐
		//    6 17  22  24  35                6 17  22
		//
		// 3. 자식이 2개인 노드의 삭제 : 삭제하는 노드를 기준으로 오른쪽자식 중 가장 작은 값 노드와 교체 후 삭제
		// 아래의 이진탐색트리에서 23 삭제
		//
		//           (23)                             24                              24
		//     ┌──────┴──────┐                 ┌──────┴──────┐                 ┌──────┴──────┐
		//     11            38                11            38                11            38
		//  ┌──┴──┐       ┌──┴──┐     =>    ┌──┴──┐       ┌──┴──┐     =>    ┌──┴──┐       ┌──┴──┐ 
		//  3     19      24    49          3     19     (23)   49          3     19      35   49
		//  └─┐ ┌─┴─┐     └─┐               └─┐ ┌─┴─┐     └─┐               └─┐ ┌─┴─┐
		//    6 17  22      35                6 17  22      35                6 17  22


		// <이진탐색트리 정렬>
		// 이진탐색트리는 중위순회시 오름차순으로 정렬됨
		//
		//             7
		//      ┌──────┴──────┐
		//      4             11
		//   ┌──┴──┐       ┌──┴──┐
		//   2     5       9     12
		// ┌─┴─┐   └─┐   ┌─┴─┐
		// 1   3     6   8   10
		//
		// 중위순회 : ((1, 2, 3), 4, (5, 6)), 7, ((8, 9, 10), 11, 12)
		//            => 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12

		
		// <이진탐색트리 시간복잡도>
		// - 평균 -
		// 접근       탐색       삽입       삭제
		// O(logn)    O(logn)    O(logn)    O(logn)


		// <이진탐색트리 주의점>
		// 이진탐색트리는 최악의 상황에 노드들이 한쪽 자식으로만 추가되는 불균형 현상이 발생 가능
		// 이 경우 탐색영역이 절반으로 줄여지지 않기 때문에 시간복잡도 증가
		//
		//           5
		//         ┌─┘
		//         4
		//       ┌─┘
		//       3
		//     ┌─┘
		//     2
		//   ┌─┘
		//   1
		//
		// 이러한 현상을 막기 위해 자가균형기능을 추가한 트리의 사용이 일반적
		// 자가균형트리는 회전을 이용하여 불균형이 있는 상황을 해결
		//
		//       8                        5
		//    ┌──┴──┐   -- 우회전 ->   ┌──┴──┐
		//    5     9                  3     8
		//  ┌─┴─┐       <- 좌회전 --       ┌─┴─┐      
		//  3   6                          6   9 
		//
		// 대표적인 방식으로 Red-Black Tree, AVL Tree 등을 통해 불균형상황을 파악



		// - 최악 -
		// 접근       탐색       삽입       삭제
		// O(n)       O(n)       O(n)       O(n)

		static void Main(string[] args)
		{
			// 이진탐색트리 기반의 SortedSet 자료구조
			// 중복이 없는 정렬을 보장한 저장소
			SortedSet<int> sortedSet = new SortedSet<int>(); // 정렬이 되어있는 Set(중복이 없는 저장소)

			// 삽입
			sortedSet.Add(1);		// 특정 위치에 내가 원하는 것 집어넣기 불가능
			sortedSet.Add(3);       // AddFirst AddLast 불가능
			sortedSet.Add(4);		// 반환형 bool
			sortedSet.Add(5);
			sortedSet.Add(2);
			sortedSet.Add(3);       // 중복 추가는 ^무시^함

			// 삭제
			sortedSet.Remove(4);	// 찾아서 지우기, RemoveAt RemoveFirst RemoveLast 불가능
			// 반환형 bool

			// 탐색
			bool success = sortedSet.Contains(3);          // 포함 확인
			bool fail = sortedSet.Contains(6);

			// 순서대로 출력시 정렬된 결과 확인(중위순회)
			foreach (int value in sortedSet)
			{
				Console.WriteLine(value);       // output : 1235
			}
			Console.WriteLine();


			// 이진탐색트리 기반의 SortedDictionary 자료구조
			// 중복을 허용하지 않는 key를 기준으로 정렬을 보장한 value 저장소
			// ↓ string : 열쇠 key, Item : 실제 내용물 value
			SortedDictionary<string, Item> sortedDictionary = new SortedDictionary<string, Item>();
			// < 정렬기준(key), 실제 데이터(value) >
			// ex) <"파이리", 파이리 공격력 방어력> <"피카츄", 피카츄 공격력 방어력>
			// "파이리" vs "피카츄" 사전 순으로 정렬 (가나다순)

			SortedSet<Item> set = new SortedSet<Item>();
			set.Add(new Item("포션", 3));
			// set.Add(new Item("버프", 3)); // 비교 불가! 포션과 버프 비교 불가

			// 삽입
			sortedDictionary.Add("포션", new Item("포션", 3)); // 앞에 있는거 먼저 기준으로 정렬
			sortedDictionary.Add("소드", new Item("소드", 10));
			sortedDictionary.Add("방패", new Item("방패", 1));
			sortedDictionary.Add("신발", new Item("신발", 100));
			sortedDictionary.Add("롱소드", new Item("롱소드", 20));
			sortedDictionary.Add("망토", new Item("망토", 30));
			// sortedDictionary.Add("포션", new Item("포션", 3)); // error : 중복을 허용하지 않음
			// 이미 있는 키값은 또 넣을 수 없음! 에러 뜬다.
			sortedDictionary.TryAdd("방패", new Item("방패", 3)); // 예외처리까지 감안하여 키 추가하는 방법
			// 방패 넣을 수 있으면 넣고 아니면 안넣기

			// 삭제
			sortedDictionary.Remove("롱소드");

			// 탐색
			sortedDictionary.ContainsKey("방패"); // 키 값이 방패인 아이템 찾기
			sortedDictionary.TryGetValue("방패", out Item shied); // 있으면 주고 없으면 안준다.
			Item item = sortedDictionary["방패"]; // 방패 아이템 변수에 저장하기, 인덱서[key]를 통한 탐색
												// 방패 아이템 없으면 오류이기 때문에 있는지 없는지 확인을 먼저 하고 문장을 써야한다.

			// 순서대로 출력시 정렬된 결과 확인
			foreach (string name in sortedDictionary.Keys)
			{
				Console.WriteLine(name);
			}
			Console.WriteLine();
			foreach (Item value in sortedDictionary.Values)
			{
				Console.WriteLine($"{value.name} {value.cost}");
			}
			Console.WriteLine();

		}
		public class Item
		{
			public string name;
			public int cost;
			public Item(string name, int value)
			{
				this.name = name;
				this.cost = value;
			}
		}
	}
}
